# NewPointOnEdgeFaceIntersection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewPointOnEdgeFaceIntersection Method
Application Class See Also
---
Construct a PointOnEdgeFaceIntersection object which is used to define the placement of a ReferencePoint given a references to edge and a reference to face.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PointOnEdgeFaceIntersection NewPointOnEdgeFaceIntersection(
	Reference edgeReference,
	Reference faceReference,
	bool orientWithEdge
)
```

Visual Basic
---
```text
Public Function NewPointOnEdgeFaceIntersection ( _
	edgeReference As Reference, _
	faceReference As Reference, _
	orientWithEdge As Boolean _
) As PointOnEdgeFaceIntersection
```

Visual C++
---
```text
public:
PointOnEdgeFaceIntersection^ NewPointOnEdgeFaceIntersection(
	Reference^ edgeReference,
	Reference^ faceReference,
	bool orientWithEdge
)
```

# ### Parameters
edgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe edge reference.
faceReference
    Type: Autodesk.Revit.DB..::..ReferenceThe face reference.
orientWithEdge
    Type: System..::..Boolean
# ### Return Value
A new PointOnEdgeFaceIntersection object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument edgeReference or faceReference is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Application Class
Autodesk.Revit.Creation Namespace